-- phpMyAdmin SQL Dump
-- version 4.6.6
-- https://www.phpmyadmin.net/
--
-- 主機: localhost
-- 產生時間： 2017-06-22 02:24:24
-- 伺服器版本: 5.7.17-log
-- PHP 版本： 5.6.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `u825104560_ygade`
--

--
-- 資料表的匯出資料 `carevent`
--

INSERT INTO `carevent` (`id`, `createdate`, `location`, `address`, `type`, `imgsource`, `sdidlist`, `imgmodidlist`, `status`) VALUES
(201704013, '2017-06-02 00:00:00', 'E120° 50\' 00\" N23° 39\' 15\"', '556台灣南投縣信義鄉坪瀨產業道路', '1', 'https://www.youtube.com/watch?v=vW3dLGLG3K8', '0,1,2,3,4,5,6,7,8,9,10', '0,1,2,3', '0'),
(201704029, '2017-05-31 00:00:00', 'E120° 55\' 20\" N21° 15\' 37\"', '556台灣南投縣信義鄉坪瀨產業道路', '3', 'https://www.youtube.com/watch?v=vW3dLGLG3K8', '11,12,13,14,15,16,17,18,19,20,21', '4,5,6,7', '0'),
(201705001, '2017-06-19 19:46:03', 'E120° 50\' 00\" N23° 39\' 15\"', '556台灣南投縣信義鄉坪瀨產業道路', '1', '影像的檔案名稱', '22,23,24,25,26,27,28,29,30,31,32', '8,9,10,11', '2');

--
-- 資料表的匯出資料 `carsensedata`
--

INSERT INTO `carsensedata` (`id`, `name`, `data`) VALUES
(0, '車輛引擎轉速(rpm)', '1.0'),
(1, '車輛行駛時速(km/h)', '2.0'),
(2, '引擎進氣溫度(oC)', '3.0'),
(3, '引擎冷卻水溫(oC)', '4.0'),
(4, '空氣流率(g/s)', '5.0'),
(5, '加速度(m/s2)', '6.0'),
(6, '煞車(Nt)', '7.0'),
(7, '燈號(on/off)', 'on'),
(8, '方向盤(度)', '9.0'),
(9, '胎溫(oC)', '10.0'),
(10, '胎壓(kg/cm2)', '11.0'),
(11, '車輛引擎轉速(rpm)', '12.0'),
(12, '車輛行駛時速(km/h)', '13.0'),
(13, '引擎進氣溫度(oC)', '14.0'),
(14, '引擎冷卻水溫(oC)', '15.0'),
(15, '空氣流率(g/s)', '16.0'),
(16, '加速度(m/s2)', '17.0'),
(17, '煞車(Nt)', '18.0'),
(18, '燈號(on/off)', 'off'),
(19, '方向盤(度)', '19.0'),
(20, '胎溫(oC)', '20.0'),
(21, '胎壓(kg/cm2)', '21.0'),
(22, '車輛引擎轉速(rpm)', '0'),
(23, '車輛行駛時速(km/h)', '1'),
(24, '引擎進氣溫度(oC)', '2'),
(25, '引擎冷卻水溫(oC)', '3'),
(26, '空氣流率(g/s)', '4'),
(27, '加速度(m/s2)', '5'),
(28, '煞車(Nt)', '6'),
(29, '燈號(on/off)', '7'),
(30, '方向盤(度)', '8'),
(31, '胎溫(oC)', '9'),
(32, '胎壓(kg/cm2)', '10');

--
-- 資料表的匯出資料 `imgmodule`
--

INSERT INTO `imgmodule` (`id`, `name`, `modified`, `paraname`, `oldpara`, `newpara`) VALUES
(0, '路面偵測模組', 0, '特徵參數,機器學習參數,特徵來源選擇,天氣狀況,早晚狀況,車輛密集度,地點', '22,3,0,1,2,0,1', ''),
(1, '前方物體偵測模組', 0, '特徵參數,機器學習參數,特徵來源選擇,天氣狀況,早晚狀況,車輛密集度,地點', '22,3,0,1,2,0,1', ''),
(2, '智慧頭燈模組', 0, '影像亮度資料,光譜敏感度,防遠近燈震盪延遲時間', '22,33,44', ''),
(3, '道路偏移偵測模組', 0, '右車道敏感度,左車道敏感度,預設偵測車道最小寬度,預設偵測車道最大寬度,警告敏感度,道路偵測失敗回溯時間長度', '22,3,0,1,2,1', ''),
(4, '路面偵測模組', 0, '特徵參數,機器學習參數,特徵來源選擇,天氣狀況,早晚狀況,車輛密集度,地點', '13,16,35,28,35,22,1', ''),
(5, '前方物體偵測模組', 0, '特徵參數,機器學習參數,特徵來源選擇,天氣狀況,早晚狀況,車輛密集度,地點', '59,72,33,4,66,84,1', ''),
(6, '智慧頭燈模組', 0, '影像亮度資料,光譜敏感度,防遠近燈震盪延遲時間', '69,73,89', ''),
(7, '道路偏移偵測模組', 0, '右車道敏感度,左車道敏感度,預設偵測車道最小寬度,預設偵測車道最大寬度,警告敏感度,道路偵測失敗回溯時間長度', '16,44,64,35,94,25', ''),
(8, '路面偵測模組', 0, '特徵參數,機器學習參數,特徵來源選擇,天氣狀況,早晚狀況,車輛密集度,地點', '22,3,0,1,2,0,1', ''),
(9, '前方物體偵測模組', 0, '特徵參數,機器學習參數,特徵來源選擇,天氣狀況,早晚狀況, 車輛密集度,地點', '22,3,0,1,2, 0,1', ''),
(10, '智慧頭燈模組', 0, '影像亮度資料,光譜敏感度,防遠近燈震盪延遲時間', '22,33,44', ''),
(11, '道路偏移偵測模組', 0, '右車道敏感度,左車道敏感度,預設偵測車道最小寬度,預設偵測車道最大寬度,警告敏感度,道路偵測失敗回溯時間長度', '22,3,0,1,2,1', '');

--
-- 資料表的匯出資料 `pretrans`
--

INSERT INTO `pretrans` (`id`, `createdate`, `empnolist`, `event＿id`, `smeventlist`, `solidlist`) VALUES
(1, '2017-06-22 10:12:35', NULL, '201705001', NULL, NULL);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
